In [36]:
import pandas as pd
dados = pd.read_csv('tips.csv')

In [37]:
dados.head()

   total_bill   tip dessert  day    time  size
0       16.99  1.01      No  Sun  Dinner     2
1       10.34  1.66      No  Sun  Dinner     3
2       21.01  3.50      No  Sun  Dinner     3
3       23.68  3.31      No  Sun  Dinner     2
4       24.59  3.61      No  Sun  Dinner     4

In [38]:
dados.columns

Index(['total_bill', 'tip', 'dessert', 'day', 'time', 'size'], dtype='object')

In [39]:
renomear = {
    'total_bill' : 'valor_conta',
    'tip' : 'gorjeta', 
    'dessert' : 'sobremesa', 
    'day': 'dia', 
    'time': 'refeição', 
    'size' : 'total_pessoas'  
}

In [40]:
gorjetas = dados.rename(columns = renomear)

In [41]:
gorjetas

     valor_conta  gorjeta sobremesa   dia refeição  total_pessoas
0          16.99     1.01        No   Sun   Dinner              2
1          10.34     1.66        No   Sun   Dinner              3
2          21.01     3.50        No   Sun   Dinner              3
3          23.68     3.31        No   Sun   Dinner              2
4          24.59     3.61        No   Sun   Dinner              4
..           ...      ...       ...   ...      ...            ...
239        29.03     5.92        No   Sat   Dinner              3
240        27.18     2.00       Yes   Sat   Dinner              2
241        22.67     2.00       Yes   Sat   Dinner              2
242        17.82     1.75        No   Sat   Dinner              2
243        18.78     3.00        No  Thur   Dinner              2

[244 rows x 6 columns]

In [42]:
gorjetas.sobremesa.unique()

array(['No', 'Yes'], dtype=object)

In [43]:
sim_nao = {
    'No': 'Não', 
    'Yes': 'Sim'
}

In [44]:
gorjetas.sobremesa = gorjetas.sobremesa.map(sim_nao)

In [45]:
gorjetas

     valor_conta  gorjeta sobremesa   dia refeição  total_pessoas
0          16.99     1.01       Não   Sun   Dinner              2
1          10.34     1.66       Não   Sun   Dinner              3
2          21.01     3.50       Não   Sun   Dinner              3
3          23.68     3.31       Não   Sun   Dinner              2
4          24.59     3.61       Não   Sun   Dinner              4
..           ...      ...       ...   ...      ...            ...
239        29.03     5.92       Não   Sat   Dinner              3
240        27.18     2.00       Sim   Sat   Dinner              2
241        22.67     2.00       Sim   Sat   Dinner              2
242        17.82     1.75       Não   Sat   Dinner              2
243        18.78     3.00       Não  Thur   Dinner              2

[244 rows x 6 columns]

In [46]:
gorjetas.dia.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [47]:
semana = {
    'Sun' : 'Dom', 
    'Sat': 'Sáb', 
    'Thur': 'Qui',
    'Fri': 'Sex'
}

In [48]:
gorjetas.dia = gorjetas.dia.map(semana)

In [49]:
refeicao = {
    'Dinner': 'Jantar', 
    'Lunch': 'Almoço'
}

In [52]:
gorjetas['refeição'] = gorjetas['refeição'].map(refeicao)

In [53]:
gorjetas

     valor_conta  gorjeta sobremesa  dia refeição  total_pessoas
0          16.99     1.01       Não  Dom   Jantar              2
1          10.34     1.66       Não  Dom   Jantar              3
2          21.01     3.50       Não  Dom   Jantar              3
3          23.68     3.31       Não  Dom   Jantar              2
4          24.59     3.61       Não  Dom   Jantar              4
..           ...      ...       ...  ...      ...            ...
239        29.03     5.92       Não  Sáb   Jantar              3
240        27.18     2.00       Sim  Sáb   Jantar              2
241        22.67     2.00       Sim  Sáb   Jantar              2
242        17.82     1.75       Não  Sáb   Jantar              2
243        18.78     3.00       Não  Qui   Jantar              2

[244 rows x 6 columns]

In [55]:
gorjetas.tail(10)

     valor_conta  gorjeta sobremesa  dia refeição  total_pessoas
234        15.53     3.00       Sim  Sáb   Jantar              2
235        10.07     1.25       Não  Sáb   Jantar              2
236        12.60     1.00       Sim  Sáb   Jantar              2
237        32.83     1.17       Sim  Sáb   Jantar              2
238        35.83     4.67       Não  Sáb   Jantar              3
239        29.03     5.92       Não  Sáb   Jantar              3
240        27.18     2.00       Sim  Sáb   Jantar              2
241        22.67     2.00       Sim  Sáb   Jantar              2
242        17.82     1.75       Não  Sáb   Jantar              2
243        18.78     3.00       Não  Qui   Jantar              2

In [56]:
gorjetas['de 0 a'] = range(gorjetas.shape[0]) #criando uma coluna

In [57]:
gorjetas

     valor_conta  gorjeta sobremesa  dia refeição  total_pessoas  de 0 a
0          16.99     1.01       Não  Dom   Jantar              2       0
1          10.34     1.66       Não  Dom   Jantar              3       1
2          21.01     3.50       Não  Dom   Jantar              3       2
3          23.68     3.31       Não  Dom   Jantar              2       3
4          24.59     3.61       Não  Dom   Jantar              4       4
..           ...      ...       ...  ...      ...            ...     ...
239        29.03     5.92       Não  Sáb   Jantar              3     239
240        27.18     2.00       Sim  Sáb   Jantar              2     240
241        22.67     2.00       Sim  Sáb   Jantar              2     241
242        17.82     1.75       Não  Sáb   Jantar              2     242
243        18.78     3.00       Não  Qui   Jantar              2     243

[244 rows x 7 columns]

In [58]:
gorjetas.drop('de 0 a', axis=1) #removendo uma coluna

     valor_conta  gorjeta sobremesa  dia refeição  total_pessoas
0          16.99     1.01       Não  Dom   Jantar              2
1          10.34     1.66       Não  Dom   Jantar              3
2          21.01     3.50       Não  Dom   Jantar              3
3          23.68     3.31       Não  Dom   Jantar              2
4          24.59     3.61       Não  Dom   Jantar              4
..           ...      ...       ...  ...      ...            ...
239        29.03     5.92       Não  Sáb   Jantar              3
240        27.18     2.00       Sim  Sáb   Jantar              2
241        22.67     2.00       Sim  Sáb   Jantar              2
242        17.82     1.75       Não  Sáb   Jantar              2
243        18.78     3.00       Não  Qui   Jantar              2

[244 rows x 6 columns]